n = int(input("Въведете число: "))
if n >= 3 and n <= 100 :
# Отпечатване на най-горния ред
 print("*" * (2*n) + " " * n + "*" * (2*n))

# Отпечатване на средните редове
 for i in range(n-2):
     if i == (n-1) // 2 - 1:
         print("*" + "/" * (2*n-2) + "*" + "|" * n + "*" + "\\" * (2*n-2) + "*" )
     else:
         print("*" + "/" * (2*n-2) + "*" + " " * n + "*" + "\\" * (2*n-2) + "*" )

 # Отпечатване на най-долния ред
 print("*" * (2*n) + " " * n + "*" * (2*n))
else:
    print("n is not in the correct range from [3 to 100]")