# Филмовата академия на САЩ от 1929г. ежегодно раздава награди Оскар на грандиозна церемония. 
# Организаторите искат да разберат колко са разходите по организирането на една такава церемония. 
# Напишете програма, която изчислява какви разходи ще има академията по организацията на събитието, 
# като знаете колко е наемът на залата, в която ще се проведе. 
# •	Статуетки  – цената им е 30% по-малка от наема на залата
# •	Кетъринг – цената му е 15% по-малка от тази на статуетките
# •	Озвучаване – цената му е 1 / 2 от цената за кетъринг


hall_rent = float(input())

statuettes_cost = hall_rent * 0.7
catering_cost = statuettes_cost * 0.85
voicing_cost = catering_cost / 2

total_cost = hall_rent + statuettes_cost + catering_cost + voicing_cost

print(f"{total_cost:.2f}")
